In [1]:
print("test")

test

In [2]:
import pandas as pd

In [3]:
data = {
    "class": ["A", "A", "B", "B"],
    "name": ["철수", "영희", "민수", "지수"],
    "score": [80, 90, 70, 85]
}

#dataframe으로 변환
df = pd.DataFrame(data)
df

  class name  score
0     A   철수     80
1     A   영희     90
2     B   민수     70
3     B   지수     85

In [6]:
#group by 객체생성
df.groupby("class")

for key, value in df.groupby("class"):
    print(f"key :{key} / value : {value}")

key :A / value :   class name  score
0     A   철수     80
1     A   영희     90
key :B / value :   class name  score
2     B   민수     70
3     B   지수     85

In [7]:
for key, value in df.groupby("class"):
    print(key)
    print(value)

A
  class name  score
0     A   철수     80
1     A   영희     90
B
  class name  score
2     B   민수     70
3     B   지수     85

In [8]:
df.groupby("class")["score"].mean()

class
A    85.0
B    77.5
Name: score, dtype: float64

In [ ]:
### SQL

# SELECT class, COUNT(*) AS cnt, AVG(score) AS avg_score
# FROM df
# WHERE score >= 70
# GROUP BY class
# HAVING AVG(score) >= 80
# ORDER BY avg_score DESC
# LIMIT 3;

In [11]:
data1 = {
    '학급': ['A', 'A', 'B', 'B', 'C', 'C'],
    '이름': ['철수', '영희', '민수', '수진', '지훈', '혜진'],
    '수학': [90, 80, 70, 85, 60, 95],
    '영어': [85, 88, 75, 70, 95, 90]
}

df1 = pd.DataFrame(data1)
df1

  학급  이름  수학  영어
0  A  철수  90  85
1  A  영희  80  88
2  B  민수  70  75
3  B  수진  85  70
4  C  지훈  60  95
5  C  혜진  95  90

In [15]:
#학급별 수학,영어점수평균, 인덱스 추가
df1_mean = df1.groupby("학급")[["수학","영어"]].mean().reset_index()

In [16]:
df1_mean

  학급    수학    영어
0  A  85.0  86.5
1  B  77.5  72.5
2  C  77.5  92.5

In [17]:
df1_mean.shape

(3, 3)

In [19]:
df2_mean = df1.groupby("학급")[["수학","영어"]].mean()
df2_mean

      수학    영어
학급
A   85.0  86.5
B   77.5  72.5
C   77.5  92.5

In [ ]:
df2_mean.shape
# 2차원 (행,열) (3,2) 인덱스가 학급임

(3, 2)

In [23]:
df1.groupby("학급")[["수학","영어"]].agg(["mean","max", "count"])

      수학              영어
    mean max count  mean max count
학급
A   85.0  90     2  86.5  88     2
B   77.5  85     2  72.5  75     2
C   77.5  95     2  92.5  95     2

In [24]:
df1[["수학","영어"]].agg(["mean","max", "count"])

         수학         영어
mean   80.0  83.833333
max    95.0  95.000000
count   6.0   6.000000